{"disqus":{"path":"/posts/2004-07-30-to-rent-or-to-buy-a-house/","commentCount":26,"comments":[{"postId":"4303143712","parentPostId":null,"date":"2004-07-30T11:24:00Z","author":"Steve K.","avatar":"","message":"<p>Have you considered a scenario that includes paying off the house versus renting the rest of your life? Or do you definitely plan on buying, just trying to find the right timing.<br>Like it or not there are emotional decisions that play into this. Will you be happier owning or renting? Surely, the amount you save or earn on renting or buying isn't what solely will determine your happiness about where you live? Is it?</p>","replies":[]},{"postId":"4303143723","parentPostId":null,"date":"2004-07-30T11:27:00Z","author":"pl","avatar":"","message":"<p>Don't forget the transaction costs involved in the purchase (agent fees are probably the lion's share).</p>","replies":[]},{"postId":"4303143725","parentPostId":null,"date":"2004-07-30T11:29:00Z","author":"Luca Bolognese","avatar":"","message":"<p>You are certainly right. No investment result is worth not being happy. I'm just talking numbers here. The rest (which is much more important) is hardly quantifiable.</p>","replies":[]},{"postId":"4303143715","parentPostId":null,"date":"2004-07-30T11:51:00Z","author":"stuart","avatar":"","message":"<p>I recently compared buying a $300K house to renting, and I was surprised, over 30 years the house would grow to $500k investing the difference between my rent and the mortgage payment (even assuming that the rent increases 100% over 30 years) resulted in a cash lump sum of $700K, so assuming you have the will power to save the money that you were going to use on a mortgage you'd be 200K richer after 30 years, not a bad situation :)</p>","replies":[]},{"postId":"4303143717","parentPostId":null,"date":"2004-07-30T11:57:00Z","author":"travis","avatar":"","message":"<p>Hmm, not only is the house I'm buying less than half the cost you listed, my mortgage rate is fixed at 4.50% (and $5K towards closing costs that I don't have to pay back, yay SONYMA).  Right now my rent is supposed to be $650/mo for ~800 sq-ft apartment (currently i have a massive discount due to renovations though), but my mortgage payments will be ~$800 (after taxes etc.) for a ~1475 sq-ft house.  And I get a driveway, yard, garage, etc.<br>For me buying definitely was the better option.  It's kind of like buying vs. leasing cars though.  There are so many factors for each person, it really makes it difficult to slap a simple formula on it.  Plus the emotional stuff like Steve K mentioned above.</p>","replies":[]},{"postId":"4303143713","parentPostId":null,"date":"2004-07-30T11:57:00Z","author":"Luca Bolognese","avatar":"","message":"<p>I came to similar conclusions. Houses look vastly overpriced right now. There is something you can do to make houses look more attractive. For example, all the equity in your house is money that is earning 0% rate of return. But this is a matter for another post:)</p>","replies":[]},{"postId":"4303143714","parentPostId":null,"date":"2004-07-30T12:04:00Z","author":"Luca Bolognese","avatar":"","message":"<p>As I said in my reply, money are not the only factor. They are not even the most important one. But you should be aware of the ramifications (or better the assumpions, nonone knows the ramifications given uncertainty about the future) implied in your choices.<br>BTW: travis, it looks like you got a pretty good deal. Not too many ft1475 houses for your price in my area.</p>","replies":[]},{"postId":"4303143716","parentPostId":null,"date":"2004-07-30T12:09:00Z","author":"Jeff","avatar":"","message":"<p>But with a house you get to deduct the interest you pay on the mortgage.  For the $200,000 mortgage at 6% this is $11933.19 per year.  In aaddition you get to deduct the real estate taxes.  In my area for this house that would be $4700.  So you have to factor in that you won't get taxed on 16633.19 of your yearly income.  That can make a big difference.</p>","replies":[]},{"postId":"4303143720","parentPostId":null,"date":"2004-07-30T12:13:00Z","author":"Mike Kozlowski","avatar":"","message":"<p>If that $200K house is bigger than a $750 apartment (around here, it'd be nearly twice the size), you need to account for that in your calculations -- you're basically paying extra to live in a larger place, and not comparing apples to apples.<br>If the apartment is the same size/quality level as that house, though, then either you've got cheap apartments or expensive houses...</p>","replies":[]},{"postId":"4303143726","parentPostId":null,"date":"2004-07-30T12:14:00Z","author":"Jeff","avatar":"","message":"<p>Also it's not really fair to assume 0% appreciate for houses.  When I bought my house 8 years ago I though prices were outrageous and couldn't imagine how they could go up much more.  I'm about to buy a new house and have the same thoughts but I know that 5 years from now I look back and laugh as how cheap it seems.  I bought my house (a 1000 sq ft ranch) for $140,000 and now it's worth about $210,000 so that's $70,000 in my pocket.</p>","replies":[]},{"postId":"4303143735","parentPostId":null,"date":"2004-07-30T12:26:00Z","author":"Tobin Titus","avatar":"","message":"<p>It's called LIBOR loans.  You pay interest only on a loan that is an ARM (adjustible rate). Don't flinch too much on the ARM thing though.  The rate is based off of the London Inter-Bank Overnight Rate. This is what banks in london charge each other for overnight deposits. Even when interest rates were skyrocketing in the US at 12%, the LIBOR rate was at 7%.  I currently only pay interest on my house -- freeing that large principal payment up for more lucrative investments.  I have a $180K home in Charlotte, NC that I pay only $850/month - that includes my taxes, insurance and home owners association fees as well.<br>I left a 1200sqft apartment that cost me $950/month for this option that also lets me write off the bulk of that payment in taxes so my payment ultimately turns out to be about $600/month after tax benefits.<br>Even after paying the extra fees like garbage collection and such, I'm \"saving\" tons of money over renting and keeping my money liquid enough to invest.</p>","replies":[]},{"postId":"4303143737","parentPostId":null,"date":"2004-07-30T12:27:00Z","author":"Doug","avatar":"","message":"<p>My house went from $160k to $250k in just 2.5 years.  It seems absurd to assume a 0% appreciation.  Particularly where I live.  Had I paid _no_ rent and saved every penny from my mortgage and utility payments (say, lived with my parents) that's about $45,000 -- still half of what I got with appreciation (I'm ignoring any interest gained by investing and money gained through tax write-offs, so it should balance a little bit).</p>","replies":[]},{"postId":"4303143744","parentPostId":null,"date":"2004-07-30T12:29:00Z","author":"drebin","avatar":"","message":"<p>Luca,<br>First of all, there are other issues such as a larger living area and just general quality of life and privacy. What about having a backyard? What about being able to turn up your TV? What about having a yard for your kids to play in??<br>But if you want to keep it financial - here are some things to consider.<br>First, 0% appreciation is VERY rare. But even assuming that, you need to run those numbers out further than 5 years. That's very short-sighted for such a large purchase.<br>I worked this up on a spreadsheet. Using your numbers, here are some things to consider.<br>In 2009 (as an isolated year), you will have almost $19,000 in tax writeoff and equity in your house. If will cost you out of pocket 2,900 less to rent - but your NET savings for the year will be around $16,100.<br>In 2014 (ten years from now, looking at one isolated year), you will have almost $38,000 in equity and in net tax savings. It will cost you 270 dollars MORE to rent by then (because of rent increases), so your NET savings that year will be almost $38,000!!<br>So yes, looking at your out-of-pocket in the next couple years - it doesn't make much sense, but when you look at the bigger picture, it's painfully obvious that this \"choice\" is not a choice at all. You should get into a house as soon as you can reasonably afford it.<br>Good luck...</p>","replies":[]},{"postId":"4303143738","parentPostId":null,"date":"2004-07-30T12:31:00Z","author":"drebin","avatar":"","message":"<p>and \"For example, all the equity in your house is money that is earning 0% rate of return.\" - that is versus renting where the money you would've put into the mortgage is gone.<br>So I'll take 0% rate of return over 100% loss any day.</p>","replies":[]},{"postId":"4303143742","parentPostId":null,"date":"2004-07-30T13:15:00Z","author":"Mikhail Arkhipov (MSFT)","avatar":"","message":"<p>Over the course of few years prices of homes in my area raised significantly (like 50%). You have to consider real estate price trends as well.</p>","replies":[]},{"postId":"4303143741","parentPostId":null,"date":"2004-07-30T14:23:00Z","author":"Marc LaFleur","avatar":"","message":"<p>Um.. Where do you live that I can get the square-footage and privacy of a $200,000 house for $750/month?</p>","replies":[]},{"postId":"4303143746","parentPostId":null,"date":"2004-07-30T17:16:00Z","author":"Luca Bolognese","avatar":"","message":"<p>Guys,<br>I'm not implying in any way that renting is always a better choices that buying. Infact I bought a home. Buying is almost always better. Moreover, as I said in a couple of previous reply, nothing is more important than your happiness.<br>My whole point is that depending on the assumptions that you make, the choice changes. If you make the assumption that houses are going to return 0% or less in the next 5 years, then, depending on one zillion of related things, then there may be a better place for your money in the next 5 years.<br>Now, will houses return 0% in the next 5 years? For the next 10 years? I don't know (and neither do you!!). There are different opinions on the matter (<a href=\"http://blogs.msdn.com/lucabol/archive/2004/07/28/199712.aspx\" rel=\"nofollow noopener\" title=\"http://blogs.msdn.com/lucabol/archive/2004/07/28/199712.aspx\">http://blogs.msdn.com/lucabol/archive/2004/07/28/199712.aspx</a> for an educated contrary opinion).<br>Intellectually I refuse to accept that houses are always the best investment. You have to make your assumptions, run your numbers and decide for yourself. I'll probably post a spreadsheet so anyone can do just that.</p>","replies":[]},{"postId":"4303143748","parentPostId":null,"date":"2004-07-30T19:48:00Z","author":"drebin","avatar":"","message":"<p>Looking at a house for a 5 year investment is a bad idea, you won't start seeing significant until after that. So if you HAVE to be out in 5 years, you may lose money. But if you plan to own a home more than 5 years, then it will start paying off - and BIG after 5 years and continue on.<br>And make no mistake, there is EXPONENTIAL population growth on this planet and a fixed amount of inhabitable space. This is basic supply and demand - real estate will ALWAYS go up. But for big purchases like this, you have to be willing to put in the time - and you will see that it WILL pay off - you just need to give it more time.<br>Personally, I think you have a really, really skewed view and if you play this \"5 years at a time\" game, in 10 or 15 years, you're still going to be renting and without a penny of equity. And on top of that, miserable because you are right on top of your neighbors.. but - you gotta do what you gotta do, good luck! :-)</p>","replies":[]},{"postId":"4303143747","parentPostId":null,"date":"2004-08-02T09:52:00Z","author":"Eric Gunnerson","avatar":"","message":"<p>Luca,<br>The low interest rates have allowed house prices to jump up quite a bit, because people choose houses based on whether they can afford the monthly payment, not the total purchase price. This is mostly true for vehicles as well.<br>This does mean we're in a bubble, and we could experience a devaluation in housing prices as some other places did in the 1980s. But Seattle is still a pretty desirable place to live, and I expect that if/when rates go up, it will just cool things down and house prices will remain fairly stable for a number of years. That's assuming there isn't a big influx of money - the Microsoft money of the late 90's combined with the money of those who came from more expensive markets pushed things up.<br>There are two big factors pushing towards owning, in my book:<br>1) Control. I can do what I want with my house<br>2) Forced saving. For a lot of people, it's the difference between paying a mortgage or spending the extra money, not investing it.<br>Having done both, I much prefer owning.<br>Eric</p>","replies":[]},{"postId":"4303143754","parentPostId":null,"date":"2009-05-29T17:51:42Z","author":"Luca Bolognese s WebLog To ren","avatar":"","message":"<p>PingBack from <a href=\"http://paidsurveyshub.info/story.php?title=luca-bolognese-s-weblog-to-rent-or-to-buy-a-house\" rel=\"nofollow noopener\" title=\"http://paidsurveyshub.info/story.php?title=luca-bolognese-s-weblog-to-rent-or-to-buy-a-house\">http://paidsurveyshub.info/story.php?title=luca-bolognese-s-weblog-to-rent-or-to-buy-a-house</a></p>","replies":[]},{"postId":"4303143755","parentPostId":null,"date":"2009-06-01T13:49:32Z","author":"Luca Bolognese s WebLog To ren","avatar":"","message":"<p>PingBack from <a href=\"http://woodtvstand.info/story.php?id=2484\" rel=\"nofollow noopener\" title=\"http://woodtvstand.info/story.php?id=2484\">http://woodtvstand.info/story.php?id=2484</a></p>","replies":[]},{"postId":"4303143756","parentPostId":null,"date":"2009-06-09T02:06:20Z","author":"Luca Bolognese s WebLog To ren","avatar":"","message":"<p>PingBack from <a href=\"http://toenailfungusite.info/story.php?id=5629\" rel=\"nofollow noopener\" title=\"http://toenailfungusite.info/story.php?id=5629\">http://toenailfungusite.info/story.php?id=5629</a></p>","replies":[]},{"postId":"4303143758","parentPostId":null,"date":"2009-06-15T20:24:04Z","author":"Luca Bolognese s WebLog To ren","avatar":"","message":"<p>PingBack from <a href=\"http://debtsolutionsnow.info/story.php?id=1664\" rel=\"nofollow noopener\" title=\"http://debtsolutionsnow.info/story.php?id=1664\">http://debtsolutionsnow.info/story.php?id=1664</a></p>","replies":[]},{"postId":"4303143757","parentPostId":null,"date":"2009-06-16T07:29:26Z","author":"Luca Bolognese s WebLog To ren","avatar":"","message":"<p>PingBack from <a href=\"http://workfromhomecareer.info/story.php?id=5733\" rel=\"nofollow noopener\" title=\"http://workfromhomecareer.info/story.php?id=5733\">http://workfromhomecareer.info/story.php?id=5733</a></p>","replies":[]},{"postId":"4303143762","parentPostId":null,"date":"2009-06-19T09:28:15Z","author":"Luca Bolognese s WebLog To ren","avatar":"","message":"<p>PingBack from <a href=\"http://edebtsettlementprogram.info/story.php?id=23130\" rel=\"nofollow noopener\" title=\"http://edebtsettlementprogram.info/story.php?id=23130\">http://edebtsettlementprogram.info/story.php?id=23130</a></p>","replies":[]},{"postId":"4303143759","parentPostId":null,"date":"2009-06-19T12:10:54Z","author":"Luca Bolognese s WebLog To ren","avatar":"","message":"<p>PingBack from <a href=\"http://mydebtconsolidator.info/story.php?id=1855\" rel=\"nofollow noopener\" title=\"http://mydebtconsolidator.info/story.php?id=1855\">http://mydebtconsolidator.info/story.php?id=1855</a></p>","replies":[]}]}}