{"disqus":{"path":"/posts/2007-04-20-a-financial-education-my-ideas/","commentCount":5,"comments":[{"postId":"4303144035","parentPostId":null,"date":"2007-04-21T13:11:46Z","author":"Charlie Calvert's Community Bl","avatar":"","message":"<p>Visual Studio Orcas Beta 1 is available for download . Though quite similar to the March CTP in terms</p>","replies":[]},{"postId":"4303144041","parentPostId":null,"date":"2007-04-22T12:10:47Z","author":"EricGu","avatar":"","message":"<p>Luca,<br>If you haven't read any of Motley Fool stuff (at <a href=\"http://www.fool.com\" rel=\"nofollow noopener\" title=\"www.fool.com\">www.fool.com</a>), that's worth a bit of your time. I've been a subscriber to their stock advisor newsletter for a couple of years, and it's been money well spent.<br>For most people, to \"beat the market\", you have to beat the mutual funds out there, and that's not that hard, because of the structural limitations that they have.<br>And yes, I agree with you - there are tons of really stupid investment ideas out there. I have a friend who in the last year has progressed from selling puts and calls all the way to having most of his money in index funds.</p>","replies":[]},{"postId":"4303144039","parentPostId":null,"date":"2007-04-23T13:46:42Z","author":"lucabol","avatar":"","message":"<p>Hi Eric,<br>I like the newsgroups on fool (i.e. the mechanical investing ones). I've never tried the newsletters because I got turned off by the quality of the books they wrote (which I deem very low).<br>But Whitney Tilson writes for them, so maybe I've been too skeptical ...<br>.luca</p>","replies":[]},{"postId":"4303144054","parentPostId":null,"date":"2007-04-24T16:18:20Z","author":"Jim Savarino","avatar":"","message":"<p>Regarding the practical application of asset allocation models.  Be careful! The theory is perfectly correct but in practice it is difficult to apply.  <br>The problem is that most discussions of the subject assume that you know the expected returns, the risk (std deviation) and the pairwise correlations between security returns.  In practice these elements need to be estimated and can contain large estimation error.  If one attempts to apply the usual deterministic quadratic programming algorithm to select the investment weights for a security population, one gets nonsense.  <br>ONLY APPLY ASSET ALLOCATION MODELS TO VERY LARGE PORTFOLOS OF SECURITiES.  THIS HAS 2 MAIN ADVANTAGES<br>First and foremost, the estimation error in the expected return and risk of large mutual funds is much less than that of individual securites do to diversification<br>Second, you are selecting from a smaller population of investment objects so the impact of estimation error on the assect allocation algorithm is reduced.<br>Sorry, couldn't resist putting in my 2 words.  Asset allocation was my research expertise in my prior life as an instructor of finance at Pacific Lutheran University.  My current life entails programming simulation models using C# which is how I came here....<br>Jim Savarino<br>Group Health Cooperative<br>Seattle WA<br><a href=\"http://savarino.je\" rel=\"nofollow noopener\" title=\"savarino.je\">savarino.je</a>@ghc.org</p>","replies":[]},{"postId":"4303144062","parentPostId":null,"date":"2007-04-24T19:47:50Z","author":"lucabol","avatar":"","message":"<p>I agree with you. I don't use optimizers because of that. I do think the theory is useful as a framework to understand the importance of diversification.</p>","replies":[]}]}}