{"disqus":{"path":"/posts/2008-01-07-book-review-the-halo-effect/","commentCount":5,"comments":[{"postId":"4303143890","parentPostId":null,"date":"2008-01-11T17:50:41Z","author":"wintermute","avatar":"","message":"<p>The process to get the decision and data available at the time of the decision are of course of paramount importance. I agree on that. What I do not agree is that we should not rate the result of the decision to judge it. After all if the process is sound but the decision we take leads to an unwanted result then the shareholders will not be happy about that. In other words, if I had to bet my money I would bet it on someone that is lucky. Lucky as Warren Buffet. I would not bet it with somebody with a good process like Myron Scholes.</p>","replies":[]},{"postId":"4303143880","parentPostId":null,"date":"2008-01-11T20:04:22Z","author":"lucabol","avatar":"","message":"<p>I disagree. You can bet on the lucky one just after the fact, and at that point he might become unlucky.<br>BTW: Buffett has a better process than Scholes because it is more tied to reality (assuming that by Scholes you mean the efficient market theorists).</p>","replies":[]},{"postId":"4303143891","parentPostId":null,"date":"2008-01-25T04:36:18Z","author":"Dolly Photon","avatar":"","message":"<p>\"The error is judging the soundness of a decision by its result\" - you can't possibly mean that! Otherwise it would be impossible to learn from experience. Where else does our knowledge of the the \"soundness\" of our processes and information come from?</p>","replies":[]},{"postId":"4303143884","parentPostId":null,"date":"2008-01-25T11:52:30Z","author":"lucabol","avatar":"","message":"<p>Excellent point !!!<br>Experience is a series of experiments with an initial state, an action and an outcome. It is the data base that helps us to form our opinion that given an initial state (i) and an action (a1) there is a certain probability (p1) that I obtain a particular outcome (o1).<br>The observed result of a decision is just a modification of the probability associated with that initial-state/action pair. It just changes your opinion of p1, often not by a large amount given that it is just one instance.<br>In this mental framework, you don't judge the soundness of a decision by the result, you just change the associated probability when you observe a certain result.<br>This is not how people think, because our minds are evolutionary wired for cause/effects relationships (i.e. I see a tiger, I better run). Nonetheless I argue it is a better framework to cope with the current world (given the observed scarcity of tigers :) ).</p>","replies":[]},{"postId":"4303143892","parentPostId":null,"date":"2008-06-06T05:26:30Z","author":"Weddings","avatar":"","message":"<p>When I read &amp;quot; Built to Last &amp;quot;, &amp;quot; In search of excellent &amp;quot; and &amp;quot; Good to great &amp;quot; I immediately thought: &amp;quot;What a bunch of BS!!&amp;quot;. But again, I think that about most business books. The content of these books seemed</p>","replies":[]}]}}